Tri-Brids/PE_RCP_RISE_TIME/test1.syscfg
epwm5.$name                                                      = "myEPWM4";
epwm5.epwmTimebase_counterMode                                   = "EPWM_COUNTER_MODE_UP_DOWN";
epwm5.epwmTimebase_period                                        = 25000;
epwm5.epwmActionQualifier_EPWM_AQ_OUTPUT_A_shadowMode            = true;
epwm5.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPA   = "EPWM_AQ_OUTPUT_HIGH";
epwm5.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_DOWN_CMPA = "EPWM_AQ_OUTPUT_LOW";
epwm5.epwmActionQualifier_EPWM_AQ_OUTPUT_B_shadowMode            = true;
epwm5.epwmEventTrigger_EPWM_SOC_B_triggerEnable                  = true;
epwm5.epwmEventTrigger_EPWM_SOC_A_triggerEnable                  = true;
epwm5.epwmEventTrigger_EPWM_SOC_A_triggerEventCountInitEnable    = true;
epwm5.epwmEventTrigger_EPWM_SOC_B_triggerEventCountInitEnable    = true;
epwm5.epwmEventTrigger_EPWM_SOC_A_triggerEventCountInitForce     = true;
epwm5.epwmEventTrigger_EPWM_SOC_B_triggerEventCountInitForce     = true;
epwm5.epwmEventTrigger_EPWM_SOC_A_triggerSource                  = "EPWM_SOC_TBCTR_U_CMPA";
epwm5.epwmEventTrigger_EPWM_SOC_B_triggerSource                  = "EPWM_SOC_TBCTR_U_CMPB";
epwm5.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_UP_CMPB   = "EPWM_AQ_OUTPUT_HIGH";
epwm5.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_DOWN_CMPB = "EPWM_AQ_OUTPUT_LOW";
epwm5.copyUse                                                    = true;
epwm5.copyFrom                                                   = "myEPWM0";
epwm5.$hardware                                                  = system.deviceData.board.components.PWM_LOC5;
epwm5.epwmCounterCompare_cmpA                                    = 12500;
epwm5.epwmCounterCompare_cmpB                                    = 12500;

epwm6.$name                                                      = "myEPWM5";
epwm6.epwmTimebase_counterMode                                   = "EPWM_COUNTER_MODE_UP_DOWN";
epwm6.epwmTimebase_period                                        = 25000;
epwm6.epwmActionQualifier_EPWM_AQ_OUTPUT_A_shadowMode            = true;
epwm6.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPA   = "EPWM_AQ_OUTPUT_HIGH";
epwm6.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_DOWN_CMPA = "EPWM_AQ_OUTPUT_LOW";
epwm6.epwmActionQualifier_EPWM_AQ_OUTPUT_B_shadowMode            = true;
epwm6.epwmEventTrigger_EPWM_SOC_B_triggerEnable                  = true;
epwm6.epwmEventTrigger_EPWM_SOC_A_triggerEnable                  = true;
epwm6.epwmEventTrigger_EPWM_SOC_A_triggerEventCountInitEnable    = true;
epwm6.epwmEventTrigger_EPWM_SOC_B_triggerEventCountInitEnable    = true;
epwm6.epwmEventTrigger_EPWM_SOC_A_triggerEventCountInitForce     = true;
epwm6.epwmEventTrigger_EPWM_SOC_B_triggerEventCountInitForce     = true;
epwm6.epwmEventTrigger_EPWM_SOC_A_triggerSource                  = "EPWM_SOC_TBCTR_U_CMPA";
epwm6.epwmEventTrigger_EPWM_SOC_B_triggerSource                  = "EPWM_SOC_TBCTR_U_CMPB";
epwm6.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_UP_CMPB   = "EPWM_AQ_OUTPUT_HIGH";
epwm6.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_DOWN_CMPB = "EPWM_AQ_OUTPUT_LOW";
epwm6.copyUse                                                    = true;
epwm6.copyFrom                                                   = "myEPWM0";
epwm6.$hardware                                                  = system.deviceData.board.components.PWM_LOC6;
epwm6.epwmCounterCompare_cmpA                                    = 12500;
epwm6.epwmCounterCompare_cmpB                                    = 12500;

epwm7.$name                                                      = "myEPWM6";
epwm7.epwmTimebase_counterMode                                   = "EPWM_COUNTER_MODE_UP_DOWN";
epwm7.epwmTimebase_period                                        = 25000;
epwm7.epwmActionQualifier_EPWM_AQ_OUTPUT_A_shadowMode            = true;
epwm7.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPA   = "EPWM_AQ_OUTPUT_HIGH";
epwm7.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_DOWN_CMPA = "EPWM_AQ_OUTPUT_LOW";
epwm7.epwmActionQualifier_EPWM_AQ_OUTPUT_B_shadowMode            = true;
epwm7.epwmEventTrigger_EPWM_SOC_B_triggerEnable                  = true;
epwm7.epwmEventTrigger_EPWM_SOC_A_triggerEnable                  = true;
epwm7.epwmEventTrigger_EPWM_SOC_A_triggerEventCountInitEnable    = true;
epwm7.epwmEventTrigger_EPWM_SOC_B_triggerEventCountInitEnable    = true;
epwm7.epwmEventTrigger_EPWM_SOC_A_triggerEventCountInitForce     = true;
epwm7.epwmEventTrigger_EPWM_SOC_B_triggerEventCountInitForce     = true;
epwm7.epwmEventTrigger_EPWM_SOC_A_triggerSource                  = "EPWM_SOC_TBCTR_U_CMPA";
epwm7.epwmEventTrigger_EPWM_SOC_B_triggerSource                  = "EPWM_SOC_TBCTR_U_CMPB";
epwm7.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_UP_CMPB   = "EPWM_AQ_OUTPUT_HIGH";
epwm7.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_DOWN_CMPB = "EPWM_AQ_OUTPUT_LOW";
epwm7.copyUse                                                    = true;
epwm7.copyFrom                                                   = "myEPWM0";
epwm7.$hardware                                                  = system.deviceData.board.components.PWM_LOC7;
epwm7.epwmCounterCompare_cmpA                                    = 12500;
epwm7.epwmCounterCompare_cmpB                                    = 12500;

epwm8.$name                                                      = "myEPWM7";
epwm8.epwmTimebase_counterMode                                   = "EPWM_COUNTER_MODE_UP_DOWN";
epwm8.epwmTimebase_period                                        = 25000;
epwm8.epwmActionQualifier_EPWM_AQ_OUTPUT_A_shadowMode            = true;
epwm8.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPA   = "EPWM_AQ_OUTPUT_HIGH";
epwm8.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_DOWN_CMPA = "EPWM_AQ_OUTPUT_LOW";
epwm8.epwmActionQualifier_EPWM_AQ_OUTPUT_B_shadowMode            = true;
epwm8.epwmEventTrigger_EPWM_SOC_B_triggerEnable                  = true;
epwm8.epwmEventTrigger_EPWM_SOC_A_triggerEnable                  = true;
epwm8.epwmEventTrigger_EPWM_SOC_A_triggerEventCountInitEnable    = true;
epwm8.epwmEventTrigger_EPWM_SOC_B_triggerEventCountInitEnable    = true;
epwm8.epwmEventTrigger_EPWM_SOC_A_triggerEventCountInitForce     = true;
epwm8.epwmEventTrigger_EPWM_SOC_B_triggerEventCountInitForce     = true;
epwm8.epwmEventTrigger_EPWM_SOC_A_triggerSource                  = "EPWM_SOC_TBCTR_U_CMPA";
epwm8.epwmEventTrigger_EPWM_SOC_B_triggerSource                  = "EPWM_SOC_TBCTR_U_CMPB";
epwm8.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_UP_CMPB   = "EPWM_AQ_OUTPUT_HIGH";
epwm8.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_DOWN_CMPB = "EPWM_AQ_OUTPUT_LOW";
epwm8.copyUse                                                    = true;
epwm8.copyFrom                                                   = "myEPWM0";
epwm8.$hardware                                                  = system.deviceData.board.components.PWM_LOC8;
epwm8.epwmCounterCompare_cmpA                                    = 12500;
epwm8.epwmCounterCompare_cmpB                                    = 12500;

inputxbar1.$name = "myINPUTXBAR0";

sci1.$name                 = "mySCI0";
sci1.enabledFIFOInterrupts = ["SCI_INT_RXFF","SCI_INT_TXFF"];
sci1.sci.$assign           = "SCIA";
sci1.sci.scirxdPin.$assign = "hsecDigital.76";
sci1.sci.scitxdPin.$assign = "hsecDigital.78";
sci1.rxQual.$name          = "myGPIOQUAL0";
sci1.txQual.$name          = "myGPIOQUAL1";
scripting.suppress("Connected to hardware,@@@.+?@@@ is connected to SCIA on the Control Card F28379D\\. Consider selecting it in \'use hardware\' above\\. @@@.+?@@@", sci1.sci, "scirxdPin");
scripting.suppress("Connected to hardware,@@@.+?@@@ is connected to SCIA on the Control Card F28379D\\. Consider selecting it in \'use hardware\' above\\. @@@.+?@@@", sci1.sci, "scitxdPin");

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
epwm1.epwm.$suggestSolution           = "EPWM1";
epwm1.epwm.epwm_aPin.$suggestSolution = "hsecDigital.49";
epwm1.epwm.epwm_bPin.$suggestSolution = "hsecDigital.51";
epwm2.epwm.$suggestSolution           = "EPWM2";
epwm2.epwm.epwm_aPin.$suggestSolution = "hsecDigital.53";
epwm2.epwm.epwm_bPin.$suggestSolution = "hsecDigital.55";
epwm3.epwm.$suggestSolution           = "EPWM3";
epwm3.epwm.epwm_aPin.$suggestSolution = "hsecDigital.50";
epwm3.epwm.epwm_bPin.$suggestSolution = "hsecDigital.52";
epwm4.epwm.$suggestSolution           = "EPWM4";
epwm4.epwm.epwm_aPin.$suggestSolution = "hsecDigital.54";
epwm4.epwm.epwm_bPin.$suggestSolution = "hsecDigital.56";
epwm5.epwm.$suggestSolution           = "EPWM5";
epwm5.epwm.epwm_aPin.$suggestSolution = "hsecDigital.57";
epwm5.epwm.epwm_bPin.$suggestSolution = "hsecDigital.59";
epwm6.epwm.$suggestSolution           = "EPWM6";
epwm6.epwm.epwm_aPin.$suggestSolution = "hsecDigital.61";
epwm6.epwm.epwm_bPin.$suggestSolution = "hsecDigital.63";
epwm7.epwm.$suggestSolution           = "EPWM7";
epwm7.epwm.epwm_aPin.$suggestSolution = "hsecDigital.58";
epwm7.epwm.epwm_bPin.$suggestSolution = "hsecDigital.60";
epwm8.epwm.$suggestSolution           = "EPWM8";
epwm8.epwm.epwm_aPin.$suggestSolution = "hsecDigital.62";
epwm8.epwm.epwm_bPin.$suggestSolution = "hsecDigital.64";
